# HalfAngle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConicalFace..::..HalfAngle Property
ConicalFace Class See Also
---
Half angle of the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double HalfAngle { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HalfAngle As Double
	Get
```

Visual C++
---
```text
public:
property double HalfAngle {
	double get ();
}
```

# See Also
ConicalFace Class
Autodesk.Revit.DB Namespace